SiliconLabs/simplicity_sdk/platform/Device/SiliconLabs/BGM26/Source/startup_bgm26.c
  for (; pDest < &__data_end__; ) {
    *pDest++ = *pSrc++;
  }
}

void Zero_Table()
{
  uint32_t        *pDest;
  extern uint32_t __bss_start__;
  extern uint32_t __bss_end__;
  pDest = &__bss_start__;

  for (; pDest < &__bss_end__; ) {
    *pDest++ = 0UL;
  }
}
#endif // defined(__START) && defined(__GNUC__)

#if !defined(SL_LEGACY_LINKER) \
  && !defined(SL_RAM_LINKER)   \
  && !defined(BOOTLOADER_ENABLE)
#if defined (__GNUC__)
__attribute__((optimize("no-tree-loop-distribute-patterns")))
#endif

void CopyMemory(const uint32_t *from, uint32_t *to, uint32_t count)
{
  while (count--) {
    *to++ = *from++;
  }
}
#if defined (__GNUC__)
void CopyToRam(void)
{
  extern uint32_t __lma_ramfuncs_start__;
  extern uint32_t __lma_ramfuncs_end__;
  extern uint32_t __ramfuncs_start__;

  uint32_t        num_instructions = &__lma_ramfuncs_end__ - &__lma_ramfuncs_start__;

  // Copy RAM functions
  CopyMemory(&__lma_ramfuncs_start__, &__ramfuncs_start__, num_instructions);
}
#elif defined (__ICCARM__)
#pragma language=save
#pragma language=extended
#pragma section="text_ram"
#pragma section="text_ram_init"
void CopyToRam(void)
{
  uint32_t num_instructions = (__section_size("text_ram") + 3) / 4;
  uint32_t * from           = __section_begin("text_ram_init");
  uint32_t * to             = __section_begin("text_ram");

  CopyMemory(from, to, num_instructions);
}
#pragma language=restore
#endif // defined(__GNUC__)
#endif // !defined(SL_LEGACY_LINKER) && !defined(SL_RAM_LINKER) && !defined(BOOTLOADER_ENABLE)
/*---------------------------------------------------------------------------
 * Reset Handler called on controller reset
 *---------------------------------------------------------------------------*/
__NO_RETURN void Reset_Handler(void)
{
  __set_MSPLIM((uint32_t) (&__STACK_LIMIT));

#if defined (SL_TRUSTZONE_SECURE) \
  && defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  __TZ_set_STACKSEAL_S((uint32_t *) (&__STACK_SEAL));
#endif // defined(SL_TRUSTZONE_SECURE) && defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)

  #ifndef __NO_SYSTEM_INIT
  SystemInit();                    /* CMSIS System Initialization */
  #endif

#if !defined(SL_LEGACY_LINKER) \
  && !defined(SL_RAM_LINKER)   \
  && !defined(BOOTLOADER_ENABLE)
  CopyToRam();
#endif // !defined(SL_LEGACY_LINKER) && !defined(SL_RAM_LINKER) && !defined(BOOTLOADER_ENABLE)

#if defined(BOOTLOADER_ENABLE)
  SystemInit2();
#endif // defined(BOOTLOADER_ENABLE)

#if defined (__GNUC__) && defined (__START)
  Copy_Table();
  Zero_Table();
  __START();
#else
  __PROGRAM_START();               /* Enter PreMain (C library entry point) */
#endif // defined(__GNUC__) && defined(__START)
}

#if defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wmissing-noreturn"
#endif // defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)

/*----------------------------------------------------------------------------
 * Default Handler for Exceptions / Interrupts
 *----------------------------------------------------------------------------*/
void Default_Handler(void)
{
  while (true) {
    // Default behavior is halting execution.
  }
}

#if defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#endif // defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
